import React from 'react'
import styles from '../styles/attraction.module.scss'
import Popup from 'reactjs-popup'
export default function leaderPopup({ open, onClose }) {
    return (
        <>
            <Popup
                open={open}
                closeOnEscape={false}
                closeOnDocumentClick={false}
                lockScroll
            >
                <div className={styles['leader-backdrop']} ></div>
                <div className={styles['popup-fixed-box']}>
                    <div className={styles['leader-popup']}>
                        <img className={styles['leader-popup-close-icon']} src='/Quit.png' onClick={() => onClose()} alt="" />
                        <div className={styles['leader-flexbox']}>
                            <div className={styles['leader-pa1']}>
                                <img src="/img/attraction/srisuwan1.jpg" alt="" />
                                <span>พระศรีสุวรรณ เจ้าเมืองสังขละบุรีคนแรก </span>
                                <span> บันทึกประวัติศาสตร์เมืองหน้าด่านทางชายแดนตะวันตกของไทย
                                    ตั้งอยู่ในบริเวณช่องเขาของเทือกเขาตะนาวศรี ดินแดนที่มีพื้นที่ป่าทุ่งใหญ่ฯเป็นอาณาบริเวณกว้างไกลไพศาล
                                    เป็นชัยภูมิแห่งการเดินทัพของพม่า และไทยมาตั้งแต่สมัยกรุงศรีอยุธยา
                                    ธนบุรี และตอนต้นกรุงรัตนโกสินทร์</span>
                            </div>
                            <div className={styles['leader-pa2']}>
                                <span>
                                    ในตอนปลายกรุงศรีอยุธยามีสาเหตุอันเนื่องมาจากพม่าได้ทำสงครามกับมอญทำให้ชาวกะเหรี่ยงได้ถูกกวาดต้อนเข้าสู่สมรภูมิรบไปด้วย
                                    ชนชาวกะเหรี่ยงกลุ่มหนึ่งได้เดินทางเข้ามาที่เมืองสังขละบุรี และได้ส่งตัวแทนไปเจรจาขอพึ่งพระโพธิ์สมภารกษัตริย์กรุงศรีอยุธยา
                                    กับเจ้าเมืองกาญจนบุรี และได้อาสาตั้งกองกำลังสอดแนมขึ้นช่วยฝ่ายกรุงศรีอยุธยาในการรบกับพม่า ซึ่งในช่วงสมัยกรุงศรีอยุธยา
                                    กรุงธนบุรี และต้นรัตนโกสินทร์ ด่านเจดีย์สามองค์ เมืองสังขละบุรี ได้กลายเป็นสมรภูมิรบที่สำคัญต่อเนื่องมาอย่างยาวนานและหนักหน่วง
                                    จนล่วงสู่ยุคสมัยกรุงรัตนโกสินทร์ตอนต้น ราวพ.ศ. 2369 ในแผ่นดินของพระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว (รัชกาลที่ 3) ได้ยกฐานะเมืองสังขละบุรีขึ้นเป็นเมืองตามระเบียบการปกครองใหม่
                                    และแต่งตั้ง ภูวะโพ่ เจ้านายกะเหรี่ยงที่เคยเป็นหัวหน้ากองกำลังสอดแนมป้องกันการรุกรานจากพม่าขึ้นเป็นเจ้าเมือง พระราชทานนามว่า “พระศรีสุวรรณคีรี” ทำการปกครองเมืองสังขละบุรีสืบมาและมีทายาทสืบทอดตำแหน่งต่อมาอีก
                                    4 คน คือ <br />1.พระศรีสุวรรณคีรี (ขุนสุวรรณ) ภูวะโพ่ <br />2.พระศรีสุวรรณคีรี (กรมเมจะ) ลูกของ ภูวะโพ่
                                    <br />3.พระศรีสุวรรณคีรี (ยังมะตุ) ลูกของ ภูวะโพ่4.พระศรีสุวรรณคีรี ( ปวยดองภู) ลูกของ กรมเมจะ
                                    <br />5.พระศรีสุวรรณคีรี (ทะเจียงโปรย เสตะพันธ์) ลูกของกรมเมจะ
                                    <br /> เลื่อนขึ้นมาจาก หลวงวิเศษสงคราม เป็นเจ้าเมืองคนสุดท้าย อันเป็นต้นตระกูลเสตะพันธุ์จนถึงปัจจุบัน และเป็นนายอำเภอคนแรกแห่งสังขละบุรี เมื่อ ปีพ.ศ. 2445-2467

                                </span>
                            </div>
                            <div className={styles['leader-pa3']}>
                                <div className={styles['leader-image-box']}>
                                    <img src="/img/attraction/srisuwan-coin-front.jpg" alt="" />
                                    <img src="/img/attraction/srisuwan-coin-back.jpg" alt="" />
                                </div>
                                <span>
                                    อธิบายภาพ
                                    ด้านหน้าเหรียญพระพุทธรัตนสังขละบุรีศรีสุวรรณ ร.3  (พระแก้วขาว)
                                    ด้านหลังพระศรีสุวรรณคีรี
                                    วัดสะเนพ่อง อำเภอสังขละบุรี จังหวัดกาญจนบุรี สร้างปี 2551
                                </span>
                            </div>
                        </div>
                    </div>

                </div>
            </Popup>
        </>
    )
}
