import React from 'react'
import styles from '../styles/attraction.module.scss'
import Popup from 'reactjs-popup'
export default function sagePopup({ open, onClose }) {
    return (
        <>
            <Popup
                open={open}
                closeOnEscape={false}
                closeOnDocumentClick={false}
                lockScroll
            >
                <div className={styles['sage-backdrop']} ></div>
                <div className={styles['popup-fixed-box']}>
                    <div className={styles['sage-popup']}>
                        <img className={styles['sage-popup-close-icon']} src='/Quit.png' onClick={() => onClose()} alt="" />
                        <div className={styles['sage-flexbox']}>
                            <div className={styles['sage-pa1']}>
                                <img src="/img/attraction/uttama1.jpg" alt="" />
                                <span>พระราชอุดมมงคล</span>
                                <span> หรือที่รู้จักกันทั่วไปในนามของ ‘หลวงพ่ออุตตมะ’ พระเกจิอาจารย์ชื่อดังของจังหวัดกาญจนบุรี ทั้งยังเป็นพระภิกษุสงฆ์ชาวมอญ ผู้มีบทบาทผู้นำคนสำคัญของชาวมอญพลัดถิ่นของสังขละบุรี</span>
                            </div>
                            <div className={styles['sage-pa2']}>
                                <span>ประวัติหลวงพ่ออุตตมะ</span>
                                <span>
                                    หลวงพ่ออุตตมะเกิดเมื่อวันอาทิตย์ขึ้น 6ค่ำ เดือน 4 ปีจอ จุลศักราช 1272 (พ.ศ.2453) ที่หมู่บ้านโมกกะเนียง ตำบล เกลาสะ อำเภอเยจังหวัดมะละแหม่ง เป็นบุตรของนางโงและนางทองสุข อาชีพทำนา มีพี่น้องรวม 12 คนเนื่องจากเป็นทารกเพศชายเกิดในวันอาทิตย์จึงมีชื่อว่า ‘เอหม่อง’
                                    ปี พ.ศ.2462 ขณะเด็กชายเอหม่องมีอายุได้ 9 ขวบ เกิดอหิวาตกโรคระบาดขึ้นในหมู่บ้าน บิดามารดาจึงพาเด็กชายเอหม่องไปฝากกับอาจารย์นันสาโรแห่งวัดโมกกะเนียงผู้เป็นลุงเพื่อให้ปรนนิบัติรับใช้และการศึกษาพระธรรมเป็นเครื่องคุ้มครองจากโรคภัย เด็กชายอหม่องเป็นผู้ใฝ่ใจในการศึกษาอย่างยิ่ง จนสามารถสอบได้ชนะเด็กในวัยเดียวกันเป็นประจำทุกๆ ปี
                                    ปี พ.ศ.2467 เด็กชายเอหม่องอายุได้ 14 ปี เกิดอหิวาตกโรคระบาดครั้งใหญ่อีกครั้งหนึ่ง ส่งผลให้ต้องสูญเสียน้องชายถึง 5 คน เด็กชายเอหม่องจึงขอออกจากวัดโนกกะเนียงเพื่อมาช่วยเหลือทางบ้านด้วยความขยันขันแข็ง จนกระทั่งอายุ 18 ปี เจ้าอาวาสวัดเกลาสะได้ไปขอกับบิดามารดาให้ด็กชายอหม่องไปบรรพชาเป็นสามเณร
                                    หลวงพ่ออุตตมะบรรพชาเป็นสามเณร ณ วัดเกลาสะ ตำบลเกลาสะ อำเภอเย จังหวัดมะละแหม่ง เมื่อจุลศักราช 1291 (พ.ศ.2472) โดยมีพระเกตุมาลาเป็นพระอุปัชฌาย์ ปีนั้นเองหลวงพ่อศึกษาภาษาบาลีและพระปริยัติธรรมจนสอบได้นักธรรมตรี อีกปีหนึ่งต่อมาสอบได้นักธรรมโท แต่ไม่นานหลวงพ่อก็ตัดสินใจสึกออกมาเพราะเห็นว่าไม่มีใครช่วยบิดามารดาทำนา จนกระทั่งหม่องเอ ซึ่งเป็นลูกของพี่สาวของบิดาได้มาอาศัยอยู่ด้วย หลังจากที่บิดามารดาของหม่องเอเสียชีวิตจนหมดสิ้นซึ่งเท่ากับว่ามีคนมาช่วยแบ่งเบาภาระในการทำนา และมีญาติซึ่งไว้วางใจได้มาคอยดูแลบิดามารดา หลวงพ่ออุตตมะจึงตัดสินใจอุปสมบทเป็นพระภิกษุที่วัดเกลาสะ โดยมีพระเกตุมาลา วัดเกลาสะ เป็นพระอุปัชฌาย์ พระนันทสาโร วัดโมกกะเนียง เป็นพระกรรมวาจารย์ พระวิสารทะวัดเจ้าคะเล เป็นพระอนุสาวนาจารย์ เมื่อวันพฤหัสบดีที่ 23 เมษายน พ.ศ.2476 ไดรับฉายาว่า “อุตตมรัมโภ” แปลว่า ผู้มีความพากเพียรอันสูงสุด โดยหลวงพ่ออุตตมะได้ตั้งเจตจำนงที่จะบวชไม่สึกจนตลอดชีวิต ด้วยความพากเพียรและใส่ใจในการศึกษาพระธรรม ในปี พ.ศ.2474 หลวพ่ออุตตมะสามารถสอบได้ นักธรรมชั้นเอก ณ สำนักเรียนวัดปราสาททอง อำเภอเย จังหวัดมะละแหม่ง ต่อมาในปี พ.ศ.2484 สอบได้เปรียญธรรม 8 ประโยค ที่สำนักเรียนวัดสุขการี อำเภอสะเทิม จังหวัดสะเทิม ซึ่งเป็นชั้นสูงสุดของคณะสงฆ์ในประเทศพม่าขณะนั้นบ้านเมืองกำลังเกิดสงครามโลกครั้งที่ 2 หลวงพ่อจึงเดินทางกลับวัดเกลาสะ และได้รับมอบหมายให้เป็นอาจารย์สอนภาษาบาลีแก่ภิกษุสามเณร ต่อมาท่านก็ลาพระอุปัชฌาย์เดินทางไปศึกษาวิปัสสนากรรมฐานที่วัดตองจอย จังหวัดมะละแหม่ง และวัดป่าเลไลย์ จังหวัดมัณฑะเลย์ จนมีความรู้ความสามารถในเรื่องวิปัสสนากรรมฐานตลอดจนวิชาไสยศาสตร์และพุทธคมเป็นอย่างดี ปี พ.ศ.2486 หลวงพ่อจึงเริ่มออกธุดงค์ไปตามที่ต่างๆ ในประเทศพม่าและเข้ามาประเทศไทยครั้งแรกทางจังหวัดเชียงใหม่ ต่อมาทราบข่าวว่าพระเกตุมาลาพระอุปัชฌาย์กำลังอาพาธ จึงรีบเดินทางกลับพม่า จนกระทั่งพระเกตุมาลามรณภาพท่านก็ได้เดินทางเข้ามาประเทศไทยอีกครั้งหนึ่ง โดยครั้งนี้ หลวงพ่อเดินทางเข้ามาทางตำบลปิล็อก อำเภอทองผาภูมิ จังหวัดกาญจนบุรี ประมาณปี พ.ศ.2492
                                    ปี พ.ศ.2492 อันเป็นพรรษาที่ 16 ของพระมหาอุตตมะรัมโภ พายุไต้ฝุ่นพัดจากทะเลอันดามัน สร้างความเสียหายให้กับชาวบ้านอย่างใหญ่หลวง โดยเฉพาะบ้านโมกกะเนียง และเกลาสะ มีผู้เสียชีวิตมากกว่าร้อยคน บ้านเรือนเหลือเพียงไม่กี่หลังคาเรือนชาวบ้านลำบากยากแค้นแสนสาหัส ข้าวของอาหารการกินขาดแคลนกันทั่วหน้า นอกจากภัยธรรมชาติแล้ว ชาวบ้านยังต้องประสบเคราะห์กรรมจากปัญหาความขัดแย้งในทางการเมืองอีกด้วย เนื่องจากการปะทะและต่อสู้ระหว่างกองกำลังทหารของรัฐบาลพม่า กับกองกำลังติดอาวุธกู้ชาติ อีกทั้งกองกำลังกู้ชาติบางส่วนแปรตัวเองไปเป็นโจรปล้นสะดมชาวบ้าน ด้วยความเบื่อหน่ายเรื่องการรบราฆ่าฟันกัน ระหว่างชนเผ่า หลวงพ่ออุตตมะจึงตัดสินใจจากบ้านเกิด มุ่งหน้าสู่ดินแดนประเทศไทย เป้าหมายที่แท้จริงของท่านในเวลานั้น คือเขาพระวิหาร ปรากฏว่าเมื่อชาวบ้านรู้ข่าวต่างเสียใจ ไม่อยากให้ท่านจากไปพากันร้องไห้ระงมด้วยความอาลัย ซึ่งท่านได้ชี้แจงการออกเดินทางของท่านว่า “การไปของเราจะเป็น ปรหิต เป็นประโยคแก่ผู้อื่น”
                                    หลวงพ่อเดินทางเข้าเมืองไทยในช่วงระหว่างปี พ.ศ.2492-2493 ทางหมู่บ้านอีต่อง ตำบลปิล็อก ชายแดนเขตจังหวัดกาญจนบุรี โดยได้รับความช่วยเหลือจากคนไทยสองคน ซึ่งมีเชื้อสายมอญพระประแดงที่มาทำเหมืองแร่ที่บ้านอีต่อง ทั้งคู่ได้จัดทำบ้านพักหลังหนึ่งให้เป็นกุฏิชั่วคราวของหลวงพ่อ เนื่องจากพื้นที่บริเวณนั้นไม่มีวัดและพระสงฆ์เลย เดิมทีนั้น คนไทยเชื้อสายมอญพระประแดงทั้งสอง ต้องการสร้างกุฏิถวายหลวงพ่ออุตตมะให้จำพรรษาอยู่ที่บ้านอีต่อง แต่หลวงพ่อไม่รับ เนื่องจากเกรงว่าจะกลายเป็นพระเถื่อนเข้าเมืองไทย ท่านจึงต้องการไปขออนุญาตจากพระผู้ใหญ่ที่ปกครองเขตปิล็อกเสียก่อน ทั้งสองจึงพาหลวงพ่ออุตตมะ มาจำพรรษาที่วัดท่าขนุน อำเภอทองผาภูมิ จังหวัดกาญจนบุรี กับหลวงพ่อไตแนม ซึ่งเป็นชาวกะเหรี่ยงและอุปสมบทที่วัดเกลาสะเช่นเดียวกับหลวงพ่ออุตตมะ
                                    ปี พ.ศ.2494 ขณะจำพรรษาที่วัดท่าขนุน อำเภอทองผาภูมิ จังหวัดกาญจนบุรี หลวงพ่ออุตตมะมีโอกาสไปสักการะพระปฐมเจดีย์ จังหวัดนครปฐม ทำให้หลวงพ่อได้พบชาวไทยเชื้อสายมอญ ที่มาจากเมืองต่างๆ เช่น แม่กลอง สมุทรสาคร มีชาวบ้านกลุ่มหนึ่งได้นิมนต์หลวงพ่อ ไปจำพรรษาที่วัดบางปลา ตำบลบ้านเกาะ อำเภอเมือง จังหวัดสมุทรสาคร
                                    หลังจากเดินทางกลับจากวัดบางปลามาจำพรรษาที่วัดท่าขนุน หลวงพ่อไตแนมขอให้หลวงพ่ออุตตมะ ไปจำพรรษาที่วัดปรังกาสีซึ่งเป็นวัดร้าง บริเวณวัดปรังกาสีมีชาวกระเหรี่ยงอาศัยอยู่เป็นจำนวนมาก และบริเวณนั้นไม่มีพระหรือวัดอื่นเลย หลวงพ่อร่วมกับกำนันชาวกะเหรี่ยงนิมนต์พระกะเหรี่ยง จากตลอดแม่น้ำแควใหญ่และแควน้อยได้ 42 รูป มาอยู่ปริวาสที่วัดปรังกาสี 9 วัน 9 คืน หลังจากนั้นก็สร้างกุฏิและเจดีย์ขึ้น หลวงพ่อนิมนต์พระกะเหรี่ยงมาจำพรรษาที่วัด 3 รูปนี้ เพื่อเป็นพื้นฐานในการสอนธรรมะต่อไป หลวงพ่ออุตตมะจำพรรษาอยู่วัดปรังกาสีหนึ่งพรรษา ต่อมาผู้ใหญ่ทุม จากท่าขนุนมานิมนต์หลวงพ่อไปเยี่ยมหลวงปู่แสงที่วัดเกาะ อำเภอโพธาราม จังหวัดราชบุรี ซึ่งเคยไปจำพรรษาที่วัดโมกกะเนียง เกลาสะและมะละแหม่งมาก่อน และในพรรษานั้นหลวงพ่ออุตตมะได้จำพรรษาที่วัดเกาะตามคำนิมนต์ของหลวงปู่แสง
                                    ปี พ.ศ.2494 ขณะที่หลวงพ่อจำพรรษาอยู่ที่วัดเกาะ มีคนมาแจ้งข่าวกับหลวงพ่อว่า ที่กิ่งอำเภอสังขละบุรีมีชาวมอญจากบ้านเดิมของหลวงพ่ออพยพเข้าเมืองไทยทางบีคลี่เป็นจำนวนมาก และต้องการนิมนต์หลวงพ่อไปเยี่ยม เมื่อหลวงพ่ออุตตมะออกจากจำพรรษา แล้วเดินทางกลับไปยังอำเภอทองผาภูมิ และไปยังอำเภอสังขละบุรี และพบกับคนมอญทั้งหมดที่มาจากโมกกะเนียงเจ้าคะเล และมะละแหม่ง บ้านเกิดของท่านหลวงพ่อจึงพาชาวมอญเหล่านี้ไปอาศัยอยู่ที่บ้านวังกะล่าง นับเป็นจุดกำเนิดแรกเริ่มของชุมชนชาวมอญในสังขละบุรี
                                </span>
                            </div>
                            <div className={styles['sage-pa3']}>
                                <div className={styles['sage-image-box']}>
                                    <img src="/img/attraction/uttama2.jpg" alt="" />
                                    <img src="/img/attraction/uttama3.jpg" alt="" />
                                </div>
                                <span>กำเนิดวัดหลวงพ่ออุตตมะ</span>
                                <span>
                                    ในปี พ.ศ.2499 หลวงพ่ออุตตมะ ร่วมกับชาวบ้านชาวกะเหรี่ยงและชาวมอญได้พร้อมใจกันสร้างศาลาวัดขึ้น และสร้างเสร็จในเดือน 6 ของปีนั้นเอง แต่เนื่องจากยังมิได้มีการขออนุญาตจากกรมการศาสนา วัดที่สร้างเสร็จจึงมีฐานะเป็นสำนักสงฆ์ แต่ชาวบ้านโดยทั่วไปเรียกว่า ‘วัดหลวงพ่ออุตตมะ’ ตั้งอยู่บนเนินสูงในบริเวณที่เรียกว่า ‘สามประสบ’ เพราะมีแม่น้ำ 3 สายไหลมาบรรจบกัน คือแม่น้ำซองกาเรีย แม่น้ำบีคลี่ และแม่น้ำรันตี
                                    ในปี พ.ศ.2505 เมื่อได้รับอนุญาตจากรมการศาสนาเป็นที่เรียบร้อย หลวงพ่ออุตตมะจึงได้ตั้งชื่อสำนักสงฆ์ตามชื่ออำเภอเก่า (อำเภอวังกะ) ว่า ‘วัดวังก์วิเวการาม’
                                    ในปี พ.ศ.2513 หลวงพ่อเริ่มสร้างพระอุโบสถวัดวังก์วิเวการาม โดยปั้นอิฐเอง
                                    ในปี พ.ศ.2518 หลวงพ่อได้เริ่มสร้างเจดีย์จำลองแบบจากเจดีย์พุทธคยาที่ประเทศอินเดีย และสร้างเสร็จในปี พ.ศ.2529
                                </span>
                            </div>
                        </div>
                    </div>

                </div>
            </Popup>
        </>
    )
}
